"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""

def main():
    lst=[
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},]
    count_sold_all=0
    summ_sold_all=0
    for product in lst:
      summ_sold_prod=sum(product['items_sold'])
      count_sold_all+=len(product['items_sold'])
      summ_sold_all+=sum(product['items_sold'])/len(product['items_sold'])
      print(f"{product['product']}: {summ_sold_prod}")
      print(f"{product['product']}: {summ_sold_prod/len(product['items_sold']):.2f} average\n-------")

    print(f"total quantity: {count_sold_all}")
    print(f"average total number of sales: {summ_sold_all:.2f}")
    
      

      
      
    
    
    
if __name__ == "__main__":
    main()
